soap/src/test/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xs="http://spring.io/guides/gs-producing-web-service" >
    <soapenv:Header/>
    <soapenv:Body>
        <xs:getUserRequest>
            <xs:Id>1</xs:Id>
            <xs:FirstName>"Paul"</xs:FirstName>
            <xs:LastName>"James"</xs:LastName>
            <xs:Age>30</xs:Age>
            <xs:Occupation>"Software Engineer"</xs:Occupation>
        </xs:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>
